##  Data Frame in the Pandas..

In [3]:
import pandas as pd

In [ ]:
df = pd.DataFrame( # Data frame must be in the dict format.
    {
        "Name":[
            "Rachit Poudel",
            "Apil Kishor Karki",
            "Anish Sharma",
        ],
        "Age":[22, 21, 24],
        "Sex":["Male", "Male","Male"],

    }
)

df

                Name  Age   Sex
0      Rachit Poudel   22  Male
1  Apil Kishor Karki   21  Male
2       Anish Sharma   24  Male

In [ ]:
df["Age"]  # the result in the dataframe the result is a pandas series to select the whole column label in Betwwen the square bracket [].

0    22
1    21
2    24
Name: Age, dtype: int64

In [ ]:
ages = pd.Series([22, 21, 24]) # pandas Series has no column labels, as it is just a single column of a DataFrame. A Series does have row labels.
ages

0    22
1    21
2    24
dtype: int64

In [13]:
# find the Maximum Age in the dataset using the dataframe.
df["Age"].max()

np.int64(24)

In [14]:
# fins the Maximum age using the Series./

ages.max()

np.int64(24)

In [15]:
# Use  the Describe to Quickly Overview the numerical data like count,mean,std, etc.

df.describe()

             Age
count   3.000000
mean   22.333333
std     1.527525
min    21.000000
25%    21.500000
50%    22.000000
75%    23.000000
max    24.000000